run/nonOrthog/sphericalSpreadingTest/origPIMPLEN1/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.water_glycerol.*"
    {
        advectionScheme   isoAdvection;
        isoFaceTol      1e-11;
        surfCellTol     1e-8;
        nAlphaBounds    3;
        snapTol         1e-12;
        clip            true;
        reconstructionScheme plicRDF;
        nAlphaSubCycles 1;
        cAlpha          1; // Note: cAlpha is not used by isoAdvector but must
                           // be specified because interfacePropertes object
                           // reads it during construction.
    }

    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       1e-12;
        // relTol          0.01;
        cacheAgglomeration no;
    }

    p_rghFinal
    {
        $p_rgh;
        // tolerance       1e-12;
        // relTol          0;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }
}


PIMPLE
{
    momentumPredictor no;
    nCorrectors     1;
    nOuterCorrectors 4;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

     /*residualControl
     {
         p_rgh
         {
                 tolerance  1e-9;
                 relTol     0.01;
         }
      }*/
    
}


// ************************************************************************* //
